In [1]:
import pandas as pd
import numpy as np

In [2]:
vdf = pd.read_csv('fruitvegprices-2017_2022.csv')

In [3]:
vdf

         category           item            variety        date  price  unit
0           fruit         apples  bramleys_seedling  2022-03-11   2.05    kg
1           fruit         apples  coxs_orange_group  2022-03-11   1.22    kg
2           fruit         apples    egremont_russet  2022-03-11   1.14    kg
3           fruit         apples           braeburn  2022-03-11   1.05    kg
4           fruit         apples               gala  2022-03-11   1.03    kg
...           ...            ...                ...         ...    ...   ...
9642  cut_flowers    alstromeria             indoor  2017-11-03   0.27  stem
9643  cut_flowers  chrysanthemum       indoor_spray  2017-11-03   0.22  stem
9644  cut_flowers        lillies           oriental  2017-11-03   0.70  stem
9645  cut_flowers      narcissus             indoor  2017-11-03   0.06  stem
9646   pot_plants       cyclamen              13_cm  2017-11-03   0.75  unit

[9647 rows x 6 columns]

## Ejercicios

### Ejercicio uno: realice un analisis de valores nulos

En caso de existir valores nulos elimine esos registros

--- Analizo los valores nulos con la funcion 'isna' y los sumo por categoria para ver cuantos hay. No hay valores nulos

In [5]:
vdf.isna().sum()

category    0
item        0
variety     0
date        0
price       0
unit        0
dtype: int64

### Ejercicio dos: Por categoria, cuantos distintos items hay y cuantos distintos variety hay?

El resultado debe de tener el siguiente formato de presentacion:

In [26]:
pd.DataFrame({
    "category" : ['cut_flowers','fruit']
    , "item_count" : [9,10]
    , "variety_Count" : [10,21]
})

      category  item_count  variety_Count
0  cut_flowers           9             10
1        fruit          10             21

Como nota en un mismo dataframe mostramos todo lo solicitado, usted debe de mostrar todas las categorias

---- Elimino los valores duplicados y luego agrupo por item y variety y hago un count en la agregacion

In [69]:
vdf2 = vdf.loc[ : , ['category', 'item', 'variety']].drop_duplicates()

In [81]:
item = vdf2.groupby(['category'], as_index = False).agg({'item' : ['count']})

In [80]:
variety = vdf2.groupby(['category'], as_index = False).agg({'variety' : ['count']})

In [82]:
item

      category  item
               count
0  cut_flowers    10
1        fruit    21
2   pot_plants     4
3    vegetable    50

In [83]:
variety

      category variety
                 count
0  cut_flowers      10
1        fruit      21
2   pot_plants       4
3    vegetable      50

--- Uno ambas tablas por medio de merge usando la categoria que es la misma en ambas tablas

In [86]:
##pd.merge(item, variety, on='category')
df= pd.merge(item, variety, on='category', how='outer')

C:\Users\chuii\anaconda3\lib\site-packages\pandas\core\generic.py:4150: PerformanceWarning: dropping on a non-lexsorted multi-index without a level parameter may impact performance.
  obj = obj._drop_axis(labels, axis, level=level, errors=errors)

In [87]:
df

      category  item variety
               count   count
0  cut_flowers    10      10
1        fruit    21      21
2   pot_plants     4       4
3    vegetable    50      50

--- Renombro y elimino una fila de columnas

In [88]:
df.columns = df.columns.droplevel(0)

In [89]:
df.columns = ['category', 'item_count', 'variety_count']

In [90]:
df

      category  item_count  variety_count
0  cut_flowers          10             10
1        fruit          21             21
2   pot_plants           4              4
3    vegetable          50             50

### Ejercicio tres: Para la combinacion item, variety muestre el ultimo valor registrado por aÃ±o.

Ejemplo de como debe de mostrar su respuesta

In [27]:
pd.DataFrame({
    "item" : ['Manzana']
    , "variety" : ['Gala']
    , "year" : [2022]
    , "last_price" :  [3.2]
})

      item variety  year  last_price
0  Manzana    Gala  2022         3.2

In [92]:
vdf

         category           item            variety        date  price  unit
0           fruit         apples  bramleys_seedling  2022-03-11   2.05    kg
1           fruit         apples  coxs_orange_group  2022-03-11   1.22    kg
2           fruit         apples    egremont_russet  2022-03-11   1.14    kg
3           fruit         apples           braeburn  2022-03-11   1.05    kg
4           fruit         apples               gala  2022-03-11   1.03    kg
...           ...            ...                ...         ...    ...   ...
9642  cut_flowers    alstromeria             indoor  2017-11-03   0.27  stem
9643  cut_flowers  chrysanthemum       indoor_spray  2017-11-03   0.22  stem
9644  cut_flowers        lillies           oriental  2017-11-03   0.70  stem
9645  cut_flowers      narcissus             indoor  2017-11-03   0.06  stem
9646   pot_plants       cyclamen              13_cm  2017-11-03   0.75  unit

[9647 rows x 6 columns]

---- Aqui saco solo el anio de cada fecha

In [136]:
vdf['year'] = pd.to_datetime(vdf['date'])

In [137]:
vdf['year'] = vdf['year'].dt.year

---- Obtengo solo las columnas que quiero mostrar en vdf1. Las agrupo y saco el max en base al anio

In [160]:
vdf1 = vdf.loc [ : , ['item', 'variety', 'year', 'price'] ]

In [157]:
vdf2 = vdf1.groupby(['item', 'variety','year'], as_index = False).max('year')

In [162]:
##vdf2.columns = vdf2.columns.droplevel(0)
vdf2.columns = ['item', 'variety', 'year', 'last_price']

----last_price muestra el valor por cada anio (comninacion de item y variety)

In [163]:
vdf2

            item       variety  year  last_price
0    alstromeria        indoor  2017        0.29
1    alstromeria        indoor  2018        0.34
2         apples      braeburn  2017        0.72
3         apples      braeburn  2018        1.05
4         apples      braeburn  2019        1.11
..           ...           ...   ...         ...
392       turnip        turnip  2021        1.83
393       turnip        turnip  2022        1.87
394   watercress  pillow_packs  2017       11.44
395   watercress  pillow_packs  2018       12.68
396   watercress  pillow_packs  2019       10.16

[397 rows x 4 columns]

### Ejercicio cuatro: Segun el ejercicio tres, que tanto aumento o disminuyo el precio de cada item-variety 

Ejemplo de como se debe de mostrar su respuesta

In [28]:
pd.DataFrame({
    "item" : ['Manzana','Manzana','Manzana']
    , "variety" : ['Gala','Gala','Gala']
    , "year" : [2020,2021,2022]
    , "last_price" :  [2.7,2.5,3.2]
    , "delta" : [0, (2.5-2.7), (3.2-2.5)]
})

      item variety  year  last_price  delta
0  Manzana    Gala  2020         2.7    0.0
1  Manzana    Gala  2021         2.5   -0.2
2  Manzana    Gala  2022         3.2    0.7

Segun nuestro ejemplo dummy para 2021 estuvo 0.2 centavos mas barato y en 2022 estuvo 0.7 centavos caro

----Obtengo el valor anterior de la columna last_price del dataframe vdf2 que es el que nos quedo en el ejercicio anterior

In [164]:
vdf2.groupby(['item'], as_index=False)['last_price'].shift(1)

     last_price
0           NaN
1          0.29
2           NaN
3          0.72
4          1.05
..          ...
392        2.00
393        1.83
394         NaN
395       11.44
396       12.68

[397 rows x 1 columns]

----- Agrego la columna precio_anterior al dataframe eliminando los valores NaN, el resultado es el dataframe vdf3

In [168]:
vdf2['precio_anterior'] = vdf2.groupby(['item'], as_index=False)['last_price'].shift(1)

In [172]:
vdf3 = vdf2.loc[ ~pd.isna(vdf2['precio_anterior']) , : ]

In [173]:
vdf3

            item       variety  year  last_price  precio_anterior
1    alstromeria        indoor  2018        0.34             0.29
3         apples      braeburn  2018        1.05             0.72
4         apples      braeburn  2019        1.11             1.05
5         apples      braeburn  2020        1.25             1.11
6         apples      braeburn  2021        1.20             1.25
..           ...           ...   ...         ...              ...
391       turnip        turnip  2020        2.00             1.58
392       turnip        turnip  2021        1.83             2.00
393       turnip        turnip  2022        1.87             1.83
395   watercress  pillow_packs  2018       12.68            11.44
396   watercress  pillow_packs  2019       10.16            12.68

[343 rows x 5 columns]

---- Agrego la columna delta que es el resultado de la resta de las columnas last_price y precio_anterior

In [175]:
vdf3['delta'] = (vdf3['last_price'] - vdf3['precio_anterior'])

C:\Users\chuii\AppData\Local\Temp/ipykernel_5604/3486414615.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  vdf3['delta'] = (vdf3['last_price'] - vdf3['precio_anterior'])

---- Los valores de delta son el resultado de la linea de codigo anterior

----Pensaba eliminar la columna precio_anterior porque en el enunciado solo pide que se vean las otras pero la dejo para notar que la resta esta correcta.

In [177]:
vdf3

            item       variety  year  last_price  precio_anterior  delta
1    alstromeria        indoor  2018        0.34             0.29   0.05
3         apples      braeburn  2018        1.05             0.72   0.33
4         apples      braeburn  2019        1.11             1.05   0.06
5         apples      braeburn  2020        1.25             1.11   0.14
6         apples      braeburn  2021        1.20             1.25  -0.05
..           ...           ...   ...         ...              ...    ...
391       turnip        turnip  2020        2.00             1.58   0.42
392       turnip        turnip  2021        1.83             2.00  -0.17
393       turnip        turnip  2022        1.87             1.83   0.04
395   watercress  pillow_packs  2018       12.68            11.44   1.24
396   watercress  pillow_packs  2019       10.16            12.68  -2.52

[343 rows x 6 columns]

### Ejercicio cinco: Cual es precio promedio por item, variety

Ejemplo de como se debe de mostrar su respuesta

In [29]:
pd.DataFrame({
    "item" : ['Manzana']
    , "variety" : ['Gala']
    , "year-month" : ['2021-01']   
    , "avg-price" : [0.5]
})

      item variety year-month  avg-price
0  Manzana    Gala    2021-01        0.5

---- Agrupo por item y variety y hago el calculo del mean por medio de la columna price. Renombro columnas

In [130]:
promedio = vdf.groupby(['item', 'variety'], as_index = False).agg({'price' : ['mean']})

In [115]:
promedio.columns = promedio.columns.droplevel(0)

In [116]:
promedio.columns = ['item', 'variety', 'avg-price']

In [131]:
promedio

           item            variety     price
                                        mean
0   alstromeria             indoor  0.281207
1        apples           braeburn  0.898141
2        apples  bramleys_seedling  1.217156
3        apples  coxs_orange_group  0.984681
4        apples    egremont_russet  1.160000
..          ...                ...       ...
80     tomatoes              round  1.021479
81     tomatoes               vine  1.518955
82       tulips             tulips  0.211031
83       turnip             turnip  1.232332
84   watercress       pillow_packs  9.374348

[85 rows x 3 columns]

### Ejercicio seis: muestre por category,item,variety que tanto % ha aumentado su precio

Ejemplo: si para las manzanas gala el primer precio que se registro fue 2.00 y el ultimo precio que se registro es 4.00 este aumento un 100%

In [36]:
pd.DataFrame({
    "category": ["fruta","fruta"]
    ,"item" : ['Manzana','Manzana']
    , "variety" : ['Gala','egremont_russet']
    , "percentage-change-between-first-and-last-price" : [200,150]       
})

,category,item,variety,percentage-change-between-first-and-last-price
0,fruta,Manzana,Gala,200
1,fruta,Manzana,egremont_russet,150

### Ejercicio siete: Segun el ejercicio seis por category cual es el item,variety con mayor aumento de crecimiento 

Segun el ejemplo dummy que se utilizo en el ejercicio seis para la category fruta se mostraria la manzana gala unicamente